In [50]:
import pandas as pd
import sqlite3 as sql

In [51]:
df1 = pd.read_csv('toilets.csv', encoding='euc-kr')

In [52]:
df1 = df[['화장실명','소재지지번주소', '위도', '경도', '구분']]

In [53]:
df1.head()

    화장실명               소재지지번주소         위도          경도     구분
0  남대문시장     서울특별시 중구 남창동 51-2  37.559433  126.976225  공중화장실
1    광희동  서울특별시 중구 광희동1가 202-1  37.564371  127.006306  공중화장실
2  신당 1호  서울특별시 중구 신당동 236-542  37.563819  127.013347  공중화장실
3  신당 2호   서울특별시 중구 신당동 298-74  37.561325  127.013778  공중화장실
4    청구역   서울특별시 중구 신당동 297-17  37.561317  127.013783  공중화장실

In [74]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25061 entries, 0 to 25060
Data columns (total 5 columns):
place_name       25061 non-null object
place_address    20898 non-null object
lat              23166 non-null float64
lon              23166 non-null float64
category         25061 non-null object
dtypes: float64(2), object(3)
memory usage: 979.0+ KB

In [54]:
df1=df1.rename(columns = {'화장실명':'place_name', '소재지지번주소':'place_address', '위도':'lat', '경도':'lon', '구분':'category'})

In [55]:
df1.head()

  place_name         place_address        lat         lon category
0      남대문시장     서울특별시 중구 남창동 51-2  37.559433  126.976225    공중화장실
1        광희동  서울특별시 중구 광희동1가 202-1  37.564371  127.006306    공중화장실
2      신당 1호  서울특별시 중구 신당동 236-542  37.563819  127.013347    공중화장실
3      신당 2호   서울특별시 중구 신당동 298-74  37.561325  127.013778    공중화장실
4        청구역   서울특별시 중구 신당동 297-17  37.561317  127.013783    공중화장실

In [56]:
# place_name 에 + 화장실, category 영어로 바꾸고 . 그리고 새로운 테이블은 남성소변기수,이런것들
df1.place_name =df1.place_name.map(lambda x:x + ' 화장실')

In [57]:
df1.head()

  place_name         place_address        lat         lon category
0  남대문시장 화장실     서울특별시 중구 남창동 51-2  37.559433  126.976225    공중화장실
1    광희동 화장실  서울특별시 중구 광희동1가 202-1  37.564371  127.006306    공중화장실
2  신당 1호 화장실  서울특별시 중구 신당동 236-542  37.563819  127.013347    공중화장실
3  신당 2호 화장실   서울특별시 중구 신당동 298-74  37.561325  127.013778    공중화장실
4    청구역 화장실   서울특별시 중구 신당동 297-17  37.561317  127.013783    공중화장실

In [58]:
df1[df1.category != '공중화장실'].category.unique()

array(['간이화장실', '개방화장실', '이동화장실', '이동화장실무계 수계공원 입구', '공중', '개방'],
      dtype=object)

In [59]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25061 entries, 0 to 25060
Data columns (total 5 columns):
place_name       25061 non-null object
place_address    20898 non-null object
lat              23166 non-null float64
lon              23166 non-null float64
category         25061 non-null object
dtypes: float64(2), object(3)
memory usage: 979.0+ KB

In [63]:
toilet_dict ={ '간이화장실':'toilet/small',
              '개방화장실':'toilet/open',
              '이동화장실':'toilet/moving',
              '이동화장실무계 수계공원 입구' :'toilet/moving',
              '공중':'toilet/open', 
              '개방':'toilet/open',
              '공중화장실':'toilet/open'
}

In [65]:
df1.category =  df1.category.map(lambda x : toilet_dict[x])

In [67]:
df1.sample(20)

,place_name,place_address,lat,lon,category
2106,강원도개발공사 화장실,강원도 춘천시 중앙로1가9,37.884267,127.729750,toilet/open
20939,대구동인동우체국 화장실,대구광역시 중구 동인동2가 74-15,35.869681,128.603556,toilet/open
23621,뉴월드코아 화장실,경기도 고양시 일산서구 일산동 1084-4,37.677259,126.768101,toilet/open
5525,영양군립전문요양원 화장실,경상북도 영양군 영양읍 화천리 763,36.640025,129.174099,toilet/open
5024,원고개시장 화장실,대구광역시 서구 비산동 719-11,35.880524,128.568415,toilet/open
5879,가족문화센터 B동 화장실,울산광역시 울주군 삼동면 조일리 1533,35.531160,129.290883,toilet/open
11401,여주교육청 화장실,경기도 여주시 상동 201번지,37.297382,127.639634,toilet/open
11130,양지면주민자치센터 화장실,경기도 용인시 처인구 양지면 양지리 460-1번지,37.236662,127.285826,toilet/open
22499,도기문화2층 화장실,전라남도 영암군 군서면 서구림리 354,34.760688,126.620041,toilet/open
6141,호암동주민센터화장실 화장실,충청북도 충주시 호암동 133-2,NaN,NaN,toilet/open
18267,솔마루공원 화장실,NaN,36.303515,127.320278,toilet/open
12896,성심의원 화장실,경기도 가평군 가평읍 대곡리 189-3,37.824096,127.515485,toilet/open
6337,방곡보건진료소 화장실,충청북도 괴산군 장연면 방곡리 186-4,36.861651,127.930329,toilet/open
17560,아우라지 광장(주차장) 화장실,강원도 정선군 여량면 여량5리?,37.461197,128.752987,toilet/open
20357,세종중학교 화장실,경상남도 밀양시 가곡동 566번지 1호,35.473779,128.763712,toilet/open
20007,로 10-9 화장실,충청남도 보령시 미산면 늑전리 산 81-3 무궁화동산,36.135588,126.404085,toilet/small
17474,진성주유소 화장실,강원도 정선군 정선읍 애산리 581번지,37.372356,128.669830,toilet/open
5332,도원리 공중화장실 화장실,충청북도 보은군 내북면 도원리 138-4,36.596982,127.651342,toilet/small
22227,목예원 화장실,NaN,37.623999,127.077850,toilet/open
15528,용지동유원지 (초원가든 앞) 화장실,전라남도 구례군 간전면 금산리48번지,35.121182,127.545889,toilet/open

In [95]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25061 entries, 0 to 25060
Data columns (total 5 columns):
place_name       25061 non-null object
place_address    20898 non-null object
lat              23166 non-null float64
lon              23166 non-null float64
category         25061 non-null object
dtypes: float64(2), object(3)
memory usage: 979.0+ KB

In [102]:
df1[df1.place_address.isna()].head()

           place_name place_address        lat         lon     category
64  남양버스정류장 공중화장실 화장실           NaN  37.466553  130.837330  toilet/open
69    구암터널옆 공중화장실 화장실           NaN  37.468443  130.831172  toilet/open
72    태하어판장 공중화장실 화장실           NaN  37.510266  130.797979  toilet/open
75    북면사택뒤 공중화장실 화장실           NaN  37.544734  130.874542  toilet/open
84       선창 공중화장실 화장실           NaN  37.544844  130.908532  toilet/open

In [111]:
df1.dropna(subset={'place_address'},inplace=True) # place_address 가 없는것 모두 제거

In [113]:
df1[df1.place_address.isna()]

Empty DataFrame
Columns: [place_name, place_address, lat, lon, category]
Index: []

In [114]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20898 entries, 0 to 24994
Data columns (total 5 columns):
place_name       20898 non-null object
place_address    20898 non-null object
lat              19570 non-null float64
lon              19570 non-null float64
category         20898 non-null object
dtypes: float64(2), object(3)
memory usage: 979.6+ KB

In [94]:
df1.isna().sum() # na 갯수 파악.

place_name          0
place_address    4163
lat              1895
lon              1895
category            0
dtype: int64

In [155]:
seoul = df1[df1['place_address'].str.contains('서울특별시')]

In [156]:
seoul.head()

  place_name         place_address        lat         lon     category
0  남대문시장 화장실     서울특별시 중구 남창동 51-2  37.559433  126.976225  toilet/open
1    광희동 화장실  서울특별시 중구 광희동1가 202-1  37.564371  127.006306  toilet/open
2  신당 1호 화장실  서울특별시 중구 신당동 236-542  37.563819  127.013347  toilet/open
3  신당 2호 화장실   서울특별시 중구 신당동 298-74  37.561325  127.013778  toilet/open
4    청구역 화장실   서울특별시 중구 신당동 297-17  37.561317  127.013783  toilet/open

In [157]:
seoul.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1195 entries, 0 to 24951
Data columns (total 5 columns):
place_name       1195 non-null object
place_address    1195 non-null object
lat              1188 non-null float64
lon              1188 non-null float64
category         1195 non-null object
dtypes: float64(2), object(3)
memory usage: 56.0+ KB

In [158]:
#lat lon, 7개 없는거 지우기
seoul.isna().sum()

place_name       0
place_address    0
lat              7
lon              7
category         0
dtype: int64

In [159]:
seoul[seoul.lat.isna()] #지워질 데이터

                place_name          place_address  lat  lon     category
4634              고려빌딩 화장실   서울특별시 금천구 독산1동 288-1  NaN  NaN  toilet/open
4635              산호빌딩 화장실     서울특별시 금천구 가산동 43-6  NaN  NaN  toilet/open
4937                백로 화장실  서울특별시 동작구 상도3동 362-46  NaN  NaN  toilet/open
7552               신계동 화장실     서울특별시 용산구 신계동 29-3  NaN  NaN  toilet/open
22345      고덕천 SK주유소 뒤 화장실     서울특별시 강동구 둔촌동 산274  NaN  NaN  toilet/open
22365  일자산자연공원(도시농업공원) 화장실       서울특별시 강동구 둔촌동119  NaN  NaN  toilet/open
22440       일자산제1체육관 뒤 화장실     서울특별시 강동구 둔촌동 산274  NaN  NaN  toilet/open

In [160]:
seoul.head()

  place_name         place_address        lat         lon     category
0  남대문시장 화장실     서울특별시 중구 남창동 51-2  37.559433  126.976225  toilet/open
1    광희동 화장실  서울특별시 중구 광희동1가 202-1  37.564371  127.006306  toilet/open
2  신당 1호 화장실  서울특별시 중구 신당동 236-542  37.563819  127.013347  toilet/open
3  신당 2호 화장실   서울특별시 중구 신당동 298-74  37.561325  127.013778  toilet/open
4    청구역 화장실   서울특별시 중구 신당동 297-17  37.561317  127.013783  toilet/open

In [143]:
#seoul.dropna(subset={'lat'},inplace=True) #이런 워닝은 무시할수 있게 패키지 로드해서 사용하면됨.

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [161]:
seoul2  = seoul.dropna()

In [162]:
seoul2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1188 entries, 0 to 24951
Data columns (total 5 columns):
place_name       1188 non-null object
place_address    1188 non-null object
lat              1188 non-null float64
lon              1188 non-null float64
category         1188 non-null object
dtypes: float64(2), object(3)
memory usage: 55.7+ KB

In [163]:
seoul2.isna().sum() #중복이없는데이터 seoul2 최종

place_name       0
place_address    0
lat              0
lon              0
category         0
dtype: int64

In [172]:
seoul2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1188 entries, 0 to 24951
Data columns (total 5 columns):
place_name       1188 non-null object
place_address    1188 non-null object
lat              1188 non-null float64
lon              1188 non-null float64
category         1188 non-null object
dtypes: float64(2), object(3)
memory usage: 55.7+ KB

In [179]:
seoul2[seoul2.duplicated(subset=['lat','lon'],keep=False)].head()

Empty DataFrame
Columns: [place_name, place_address, lat, lon, category]
Index: []

In [176]:
import warnings
warnings.filterwarnings('ignore')

In [177]:
seoul2.drop_duplicates(subset=['lat','lon'],inplace=True) # 이렇게 하려했으나 안되서.

In [180]:
seoul2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1117 entries, 0 to 24946
Data columns (total 5 columns):
place_name       1117 non-null object
place_address    1117 non-null object
lat              1117 non-null float64
lon              1117 non-null float64
category         1117 non-null object
dtypes: float64(2), object(3)
memory usage: 52.4+ KB

In [183]:
a = [i for i in range(10331,11448)]

In [184]:
len(a)

1117

In [185]:
seoul2['place_id']=a

In [187]:
seoul2.head()

,place_name,place_address,lat,lon,category,place_id
0,남대문시장 화장실,서울특별시 중구 남창동 51-2,37.559433,126.976225,toilet/open,10331
1,광희동 화장실,서울특별시 중구 광희동1가 202-1,37.564371,127.006306,toilet/open,10332
2,신당 1호 화장실,서울특별시 중구 신당동 236-542,37.563819,127.013347,toilet/open,10333
3,신당 2호 화장실,서울특별시 중구 신당동 298-74,37.561325,127.013778,toilet/open,10334
4,청구역 화장실,서울특별시 중구 신당동 297-17,37.561317,127.013783,toilet/open,10335

In [188]:
seoul2.tail()

,place_name,place_address,lat,lon,category,place_id
24934,성수근린공원 화장실,서울특별시 성동구 성수동2가 302-25,37.566074,127.047049,toilet/open,11443
24941,독서당공원 화장실,서울특별시 성동구 금호동1가 산37-7,37.556445,127.019518,toilet/open,11444
24943,왕십리문화공원 화장실,서울특별시 성동구 도선동 35-2,37.553588,127.041916,toilet/open,11445
24945,한양대 앞 화장실,서울특별시 성동구 행당동 157-4,37.566104,127.045757,toilet/open,11446
24946,행당어린이공원 화장실,서울특별시 성동구 행당동 128-417,37.561760,127.035263,toilet/open,11447

In [47]:
ss.describe()

                 count unique          top  freq
구분
간이화장실             1373     18         24시간   646
개방                  51     22         24시간    27
개방화장실             6277    217  09:00~18:00  1886
공중                  80      1         24시간    80
공중화장실            16758    189         연중무휴  4515
이동화장실              521      4         24시간   285
이동화장실무계 수계공원 입구      1      1         24시간     1

In [189]:
pd.DataFrame.to_csv(seoul2,'seoul_toilets.csv')